IM-Lab-france/ReefControl/esp32_cam_eye/esp32_cam_eye.ino
#include <Arduino.h>
#include "esp_camera.h"
#include <WiFi.h>
#include <WebServer.h>
#include <Preferences.h>
#include <esp_wifi.h>
#include <ArduinoOTA.h>
#include <DNSServer.h>

#ifndef ESP_ARDUINO_VERSION_MAJOR
#define ESP_ARDUINO_VERSION_MAJOR 1
#define ESP_ARDUINO_VERSION_MINOR 0
#define ESP_ARDUINO_VERSION_PATCH 0
#endif

#if ESP_ARDUINO_VERSION_MAJOR >= 2
#define WIFI_EVT_AP_START ARDUINO_EVENT_WIFI_AP_START
#define WIFI_EVT_AP_STOP ARDUINO_EVENT_WIFI_AP_STOP
#define WIFI_EVT_AP_STACONNECTED ARDUINO_EVENT_WIFI_AP_STACONNECTED
#define WIFI_EVT_AP_STADISCONNECTED ARDUINO_EVENT_WIFI_AP_STADISCONNECTED
#define WIFI_EVT_STA_CONNECTED ARDUINO_EVENT_WIFI_STA_CONNECTED
#define WIFI_EVT_STA_DISCONNECTED ARDUINO_EVENT_WIFI_STA_DISCONNECTED
#else
#define WIFI_EVT_AP_START SYSTEM_EVENT_AP_START
#define WIFI_EVT_AP_STOP SYSTEM_EVENT_AP_STOP
#define WIFI_EVT_AP_STACONNECTED SYSTEM_EVENT_AP_STACONNECTED
#define WIFI_EVT_AP_STADISCONNECTED SYSTEM_EVENT_AP_STADISCONNECTED
#define WIFI_EVT_STA_CONNECTED SYSTEM_EVENT_STA_CONNECTED
#define WIFI_EVT_STA_DISCONNECTED SYSTEM_EVENT_STA_DISCONNECTED
#endif

#define CAMERA_MODEL_AI_THINKER

#define PWDN_GPIO_NUM 32
#define RESET_GPIO_NUM -1
#define XCLK_GPIO_NUM 0
#define SIOD_GPIO_NUM 26
#define SIOC_GPIO_NUM 27

#define Y9_GPIO_NUM 35
#define Y8_GPIO_NUM 34
#define Y7_GPIO_NUM 39
#define Y6_GPIO_NUM 36
#define Y5_GPIO_NUM 21
#define Y4_GPIO_NUM 19
#define Y3_GPIO_NUM 18
#define Y2_GPIO_NUM 5
#define VSYNC_GPIO_NUM 25
#define HREF_GPIO_NUM 23
#define PCLK_GPIO_NUM 22

const uint32_t WIFI_TIMEOUT_MS = 15000;
const char *AP_PASSWORD = "esp32setup";
const IPAddress AP_IP(192, 168, 4, 1);
const IPAddress AP_GATEWAY(192, 168, 4, 1);
const IPAddress AP_NETMASK(255, 255, 255, 0);

Preferences prefs;
WebServer server(80);
DNSServer dnsServer;
const byte DNS_PORT = 53;
bool dnsRunning = false;

const size_t MAX_REQUEST_BODY = 2048;
String pendingRequestBody;
bool pendingRequestBodyTruncated = false;

struct WifiConfig
{
  String ssid;
  String password;
};

struct ImageSettings
{
  int brightness;
  int contrast;
  int saturation;
  framesize_t framesize;
};

WifiConfig wifiConfig;
ImageSettings imageSettings;

bool staConnected = false;
bool apMode = false;
bool otaEnabled = false;
String apSSID;

struct FrameSizeMap
{
  const char *name;
  framesize_t size;
};

const FrameSizeMap frameSizeMap[] = {
    {"QVGA", FRAMESIZE_QVGA},
    {"VGA", FRAMESIZE_VGA},
    {"SVGA", FRAMESIZE_SVGA},
    {"XGA", FRAMESIZE_XGA},
    {"UXGA", FRAMESIZE_UXGA}};

String escapeJson(const String &value)
{
  String out;
  out.reserve(value.length());
  for (size_t i = 0; i < value.length(); ++i)
  {
    char c = value[i];
    switch (c)
    {
    case '\\':
      out += "\\\\";
      break;
    case '"':
      out += "\\\"";
      break;
    case '\n':
      out += "\\n";
      break;
    case '\r':
      out += "\\r";
      break;
    case '\t':
      out += "\\t";
      break;
    default:
      if (static_cast<uint8_t>(c) < 0x20)
      {
        char buf[7];
        snprintf(buf, sizeof(buf), "\\u%04x", c);
        out += buf;
      }
      else
      {
        out += c;
      }
    }
  }
  return out;
}

String htmlEscape(const String &value)
{
  String out;
  out.reserve(value.length());
  for (size_t i = 0; i < value.length(); ++i)
  {
    char c = value[i];
    if (c == '&')
      out += "&amp;";
    else if (c == '<')
      out += "&lt;";
    else if (c == '>')
      out += "&gt;";
    else if (c == '\"')
      out += "&quot;";
    else if (c == '\'')
      out += "&#39;";
    else
      out += c;
  }
  return out;
}

framesize_t frameSizeFromString(const String &name)
{
  for (const auto &entry : frameSizeMap)
  {
    if (name.equalsIgnoreCase(entry.name))
    {
      return entry.size;
    }
  }
  return FRAMESIZE_SVGA;
}

String frameSizeToString(framesize_t size)
{
  for (const auto &entry : frameSizeMap)
  {
    if (entry.size == size)
    {
      return String(entry.name);
    }
  }
  return String("SVGA");
}

int clampSetting(int value)
{
  if (value < -2)
    return -2;
  if (value > 2)
    return 2;
  return value;
}

const char *httpMethodToString(HTTPMethod method)
{
  switch (method)
  {
  case HTTP_GET:
    return "GET";
  case HTTP_POST:
    return "POST";
  case HTTP_PUT:
    return "PUT";
  case HTTP_PATCH:
    return "PATCH";
  case HTTP_DELETE:
    return "DELETE";
  case HTTP_OPTIONS:
    return "OPTIONS";
  default:
    return "UNKNOWN";
  }
}

void resetPendingRequestBody()
{
  pendingRequestBody = "";
  pendingRequestBodyTruncated = false;
}

void handleRawRequestBody()
{
  HTTPRaw &raw = server.raw();
  if (raw.status == RAW_START)
  {
    resetPendingRequestBody();
    int expected = server.clientContentLength();
    if (expected > 0 && static_cast<size_t>(expected) < MAX_REQUEST_BODY)
    {
      pendingRequestBody.reserve(static_cast<size_t>(expected));
    }
    return;
  }

  if (raw.status != RAW_WRITE || raw.currentSize == 0)
  {
    if (raw.status == RAW_END && pendingRequestBodyTruncated)
    {
      Serial.println("[HTTP] Corps de requete tronque (taille depassee)");
    }
    return;
  }

  if (pendingRequestBody.length() >= MAX_REQUEST_BODY)
  {
    pendingRequestBodyTruncated = true;
    return;
  }

  size_t remaining = MAX_REQUEST_BODY - pendingRequestBody.length();
  size_t chunkSize = raw.currentSize;
  if (chunkSize > remaining)
  {
    chunkSize = remaining;
    pendingRequestBodyTruncated = true;
  }
  pendingRequestBody.concat(reinterpret_cast<const char *>(raw.buf), chunkSize);
}

String consumeRequestBody()
{
  if (server.hasArg("plain"))
  {
    String direct = server.arg("plain");
    resetPendingRequestBody();
    return direct;
  }
  String body = pendingRequestBody;
  resetPendingRequestBody();
  return body;
}

void logHttpRequest(const String &path)
{
  WiFiClient client = server.client();
  IPAddress remote = client ? client.remoteIP() : IPAddress();
  Serial.printf("[HTTP] %s %s from %s (mode %s)\n",
                httpMethodToString(server.method()),
                path.c_str(),
                remote.toString().c_str(),
                apMode ? "AP" : "STA");
}

void wifiEventHandler(WiFiEvent_t event, WiFiEventInfo_t info)
{
  switch (event)
  {
  case WIFI_EVT_AP_START:
    Serial.println("[WIFI] SoftAP started");
    break;
  case WIFI_EVT_AP_STOP:
    Serial.println("[WIFI] SoftAP stopped");
    break;
  case WIFI_EVT_AP_STACONNECTED:
    Serial.printf("[WIFI] Station %02X:%02X:%02X:%02X:%02X:%02X joined AP (aid=%u)\n",
                  info.wifi_ap_staconnected.mac[0], info.wifi_ap_staconnected.mac[1],
                  info.wifi_ap_staconnected.mac[2], info.wifi_ap_staconnected.mac[3],
                  info.wifi_ap_staconnected.mac[4], info.wifi_ap_staconnected.mac[5],
                  info.wifi_ap_staconnected.aid);
    break;
  case WIFI_EVT_AP_STADISCONNECTED:
    Serial.printf("[WIFI] Station %02X:%02X:%02X:%02X:%02X:%02X left AP (aid=%u)\n",
                  info.wifi_ap_stadisconnected.mac[0], info.wifi_ap_stadisconnected.mac[1],
                  info.wifi_ap_stadisconnected.mac[2], info.wifi_ap_stadisconnected.mac[3],
                  info.wifi_ap_stadisconnected.mac[4], info.wifi_ap_stadisconnected.mac[5],
                  info.wifi_ap_stadisconnected.aid);
    break;
  case WIFI_EVT_STA_CONNECTED:
    Serial.println("[WIFI] Connected to upstream AP");
    break;
  case WIFI_EVT_STA_DISCONNECTED:
    Serial.printf("[WIFI] Disconnected from upstream AP (reason %d)\n", info.wifi_sta_disconnected.reason);
    break;
  default:
    break;
  }
}

void loadConfigs()
{
  wifiConfig.ssid = prefs.getString("wifi_ssid", "");
  wifiConfig.password = prefs.getString("wifi_password", "");
  imageSettings.brightness = prefs.getShort("img_brightness", 0);
  imageSettings.contrast = prefs.getShort("img_contrast", 0);
  imageSettings.saturation = prefs.getShort("img_saturation", 0);
  String storedFrame = prefs.getString("img_framesize", "SVGA");
  imageSettings.framesize = frameSizeFromString(storedFrame);
}

void saveWifiConfig(const String &ssid, const String &password)
{
  prefs.putString("wifi_ssid", ssid);
  prefs.putString("wifi_password", password);
  wifiConfig.ssid = ssid;
  wifiConfig.password = password;
}

