IM-Lab-france/ReefControl/esp32_cam_eye/esp32_cam_eye.ino
void saveImageSettings()
{
  prefs.putShort("img_brightness", imageSettings.brightness);
  prefs.putShort("img_contrast", imageSettings.contrast);
  prefs.putShort("img_saturation", imageSettings.saturation);
  prefs.putString("img_framesize", frameSizeToString(imageSettings.framesize));
}

void applyImageSettings()
{
  sensor_t *sensor = esp_camera_sensor_get();
  if (!sensor)
  {
    Serial.println("Sensor not ready");
    return;
  }
  sensor->set_brightness(sensor, clampSetting(imageSettings.brightness));
  sensor->set_contrast(sensor, clampSetting(imageSettings.contrast));
  sensor->set_saturation(sensor, clampSetting(imageSettings.saturation));
  sensor->set_framesize(sensor, imageSettings.framesize);
}

void initCamera()
{
  camera_config_t config;
  config.ledc_channel = LEDC_CHANNEL_0;
  config.ledc_timer = LEDC_TIMER_0;
  config.pin_d0 = Y2_GPIO_NUM;
  config.pin_d1 = Y3_GPIO_NUM;
  config.pin_d2 = Y4_GPIO_NUM;
  config.pin_d3 = Y5_GPIO_NUM;
  config.pin_d4 = Y6_GPIO_NUM;
  config.pin_d5 = Y7_GPIO_NUM;
  config.pin_d6 = Y8_GPIO_NUM;
  config.pin_d7 = Y9_GPIO_NUM;
  config.pin_xclk = XCLK_GPIO_NUM;
  config.pin_pclk = PCLK_GPIO_NUM;
  config.pin_vsync = VSYNC_GPIO_NUM;
  config.pin_href = HREF_GPIO_NUM;
  config.pin_sccb_sda = SIOD_GPIO_NUM;
  config.pin_sccb_scl = SIOC_GPIO_NUM;
  config.pin_pwdn = PWDN_GPIO_NUM;
  config.pin_reset = RESET_GPIO_NUM;
  config.xclk_freq_hz = 20000000;
  config.pixel_format = PIXFORMAT_JPEG;
  config.frame_size = FRAMESIZE_UXGA;
  config.jpeg_quality = 12;
  config.fb_count = 1;
  config.grab_mode = CAMERA_GRAB_LATEST;
  config.fb_location = CAMERA_FB_IN_PSRAM;

  esp_err_t err = esp_camera_init(&config);
  if (err != ESP_OK)
  {
    Serial.printf("Camera init failed: 0x%x\n", err);
    return;
  }
  applyImageSettings();
}

void startAccessPoint()
{
  uint8_t mac[6];
  esp_wifi_get_mac(WIFI_IF_STA, mac);
  char suffix[5];
  snprintf(suffix, sizeof(suffix), "%02X%02X", mac[4], mac[5]);
  apSSID = "ESP32-CAM-SETUP-" + String(suffix);
  WiFi.mode(WIFI_AP);
  WiFi.softAPConfig(AP_IP, AP_GATEWAY, AP_NETMASK);
  WiFi.softAP(apSSID.c_str(), AP_PASSWORD);
  apMode = true;
  staConnected = false;
  otaEnabled = false;
  dnsServer.stop();
  dnsRunning = dnsServer.start(DNS_PORT, "*", AP_IP);
  Serial.printf("Started AP %s @ %s\n", apSSID.c_str(), WiFi.softAPIP().toString().c_str());

  if (dnsRunning)
  {
    Serial.println("DNS captif demarre sur port 53");
  }
  else
  {
    Serial.println("DNS captif indisponible");
  }
}

void startWiFi()
{
  if (wifiConfig.ssid.isEmpty())
  {
    Serial.println("No WiFi credentials stored. Starting AP...");
    startAccessPoint();
    return;
  }

  WiFi.mode(WIFI_STA);
  WiFi.begin(wifiConfig.ssid.c_str(), wifiConfig.password.c_str());
  Serial.printf("Connecting to %s", wifiConfig.ssid.c_str());
  unsigned long startAttempt = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - startAttempt < WIFI_TIMEOUT_MS)
  {
    delay(500);
    Serial.print('.');
  }
  Serial.println();
  if (WiFi.status() == WL_CONNECTED)
  {
    staConnected = true;
    apMode = false;
    if (dnsRunning)
    {
      dnsServer.stop();
      dnsRunning = false;
    }
    Serial.printf("Connected. IP: %s\n", WiFi.localIP().toString().c_str());
  }
  else
  {
    Serial.println("Failed to connect, starting AP");
    startAccessPoint();
  }
}

String buildOtaHostname()
{
  String mac = WiFi.macAddress();
  mac.replace(":", "");
  if (mac.length() >= 4)
  {
    return "ESP32-CAM-EYE-" + mac.substring(mac.length() - 4);
  }
  return "ESP32-CAM-EYE";
}

void setupOTA()
{
  if (!staConnected)
  {
    otaEnabled = false;
    return;
  }
  String host = buildOtaHostname();
  ArduinoOTA.setHostname(host.c_str());
  ArduinoOTA.onStart([]()
                     { Serial.println("OTA update start"); });
  ArduinoOTA.onEnd([]()
                   { Serial.println("\nOTA update end"); });
  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total)
                        { Serial.printf("OTA progress: %u%%\n", (progress * 100) / total); });
  ArduinoOTA.onError([](ota_error_t error)
                     { Serial.printf("OTA error[%u]\n", error); });
  ArduinoOTA.begin();
  otaEnabled = true;
  Serial.printf("OTA ready on host %s\n", host.c_str());
}

String buildSettingsJsonPayload(bool includeWifi)
{
  String json = "{";
  json += "\"brightness\":" + String(imageSettings.brightness) + ',';
  json += "\"contrast\":" + String(imageSettings.contrast) + ',';
  json += "\"saturation\":" + String(imageSettings.saturation) + ',';
  json += "\"framesize\":\"" + frameSizeToString(imageSettings.framesize) + "\"";
  if (includeWifi)
  {
    json += ",\"wifi_ssid\":\"" + escapeJson(wifiConfig.ssid) + "\"";
  }
  json += '}';
  return json;
}

String buildFullConfigJson()
{
  String json = "{";
  json += "\"wifi_ssid\":\"" + escapeJson(wifiConfig.ssid) + "\",";
  json += "\"brightness\":" + String(imageSettings.brightness) + ',';
  json += "\"contrast\":" + String(imageSettings.contrast) + ',';
  json += "\"saturation\":" + String(imageSettings.saturation) + ',';
  json += "\"framesize\":\"" + frameSizeToString(imageSettings.framesize) + "\"";
  json += '}';
  return json;
}

void sendJsonError(int code, const String &detail)
{
  String json = "{\"error\":\"" + escapeJson(detail) + "\"}";
  server.send(code, "application/json", json);
}

bool extractJsonString(const String &payload, const char *key, String &out)
{
  String pattern = String('\"') + key + '\"';
  int keyIndex = payload.indexOf(pattern);
  if (keyIndex < 0)
    return false;
  int colonIndex = payload.indexOf(':', keyIndex + pattern.length());
  if (colonIndex < 0)
    return false;
  int valueStart = colonIndex + 1;
  while (valueStart < payload.length() && isspace(payload[valueStart]))
    valueStart++;
  if (valueStart >= payload.length() || payload[valueStart] != '\"')
    return false;
  int cursor = valueStart + 1;
  String value;
  while (cursor < payload.length())
  {
    char c = payload[cursor];
    if (c == '\\' && cursor + 1 < payload.length())
    {
      value += payload[cursor + 1];
      cursor += 2;
      continue;
    }
    if (c == '\"')
      break;
    value += c;
    cursor++;
  }
  out = value;
  return true;
}

bool extractJsonInt(const String &payload, const char *key, int &out)
{
  String pattern = String('\"') + key + '\"';
  int keyIndex = payload.indexOf(pattern);
  if (keyIndex < 0)
    return false;
  int colonIndex = payload.indexOf(':', keyIndex + pattern.length());
  if (colonIndex < 0)
    return false;
  int valueStart = colonIndex + 1;
  while (valueStart < payload.length() && isspace(payload[valueStart]))
    valueStart++;
  if (valueStart >= payload.length())
    return false;
  int valueEnd = valueStart;
  while (valueEnd < payload.length() && (isdigit(payload[valueEnd]) || payload[valueEnd] == '-'))
  {
    valueEnd++;
  }
  if (valueEnd == valueStart)
    return false;
  String number = payload.substring(valueStart, valueEnd);
  out = number.toInt();
  return true;
}

