IM-Lab-france/ReefControl/esp32_cam_eye/esp32_cam_eye.ino
void handleRoot()
{
  logHttpRequest(server.uri());
  String modeDescription = staConnected ? String("STA (connecte)") : (apMode ? String("AP (configuration)") : String("STA (non connecte)"));
  String ip = staConnected ? WiFi.localIP().toString() : (apMode ? WiFi.softAPIP().toString() : String("0.0.0.0"));
  String html = F("<!DOCTYPE html><html><head><meta charset='utf-8'><meta name='viewport' content='width=device-width,initial-scale=1'><title>ESP32-CAM</title><style>body{font-family:Arial,Helvetica,sans-serif;margin:24px;background:#f7f7f7;color:#111;}a.button{display:inline-block;margin:8px 8px 0 0;padding:10px 16px;background:#0366d6;color:#fff;border-radius:4px;text-decoration:none;}section{background:#fff;padding:16px;border-radius:8px;margin-bottom:12px;box-shadow:0 1px 3px rgba(0,0,0,0.1);}h1{margin-top:0;}</style></head><body>");
  html += "<h1>ESP32-CAM Eye</h1><section><h3>Etat WiFi</h3><p>Mode: " + modeDescription + "</p><p>IP: " + ip + "</p></section>";
  html += "<section><h3>Navigation</h3><a class='button' href='/wifi'>Config WiFi</a><a class='button' href='/image'>Reglages image</a><a class='button' href='/capture' target='_blank'>Capture JPEG</a></section>";
  html += "</body></html>";
  server.send(200, "text/html", html);
}

String buildFrameOptionsHtml()
{
  String options;
  for (const auto &entry : frameSizeMap)
  {
    options += "<option value='";
    options += entry.name;
    options += "'";
    if (entry.size == imageSettings.framesize)
    {
      options += " selected";
    }
    options += ">";
    options += entry.name;
    options += "</option>";
  }
  return options;
}

void handleWifiPage()
{
  logHttpRequest(server.uri());
  String html = F("<!DOCTYPE html><html><head><meta charset='utf-8'><meta name='viewport' content='width=device-width,initial-scale=1'><title>WiFi Setup</title><style>body{font-family:Arial;margin:24px;background:#eef2f7;}label{display:block;margin-top:12px;}input{width:100%;padding:8px;margin-top:4px;}button{margin-top:16px;padding:10px 16px;background:#0b8457;color:white;border:none;border-radius:4px;}#status{margin-top:12px;font-weight:bold;}</style></head><body><h2>Configurer le WiFi</h2><p>Entrez le SSID et le mot de passe pour le mode station.</p>");
  html += "<label>SSID<input type='text' id='ssid' value='" + htmlEscape(wifiConfig.ssid) + "'></label>";
  html += "<label>Mot de passe<input type='password' id='password' value='" + htmlEscape(wifiConfig.password) + "'></label>";
  html += F("<button onclick=\"saveWifi()\">Enregistrer</button><div id='status'></div><script>function saveWifi(){const body={ssid:document.getElementById('ssid').value,password:document.getElementById('password').value};fetch('/api/wifi',{method:'POST',headers:{'Content-Type':'application/json'},body:JSON.stringify(body)}).then(r=>r.json()).then(()=>{document.getElementById('status').textContent='Sauvegarde reussie, redemarrage...';}).catch(()=>{document.getElementById('status').textContent='Erreur de sauvegarde';});}</script></body></html>");
  server.send(200, "text/html", html);
}

void handleImagePage()
{
  logHttpRequest(server.uri());
  String html = F("<!DOCTYPE html><html><head><meta charset='utf-8'><meta name='viewport' content='width=device-width,initial-scale=1'><title>Reglages image</title><style>body{font-family:Arial;margin:24px;background:#fefefe;}label{display:block;margin:12px 0 4px;}input[type=range]{width:100%;}select{width:100%;padding:8px;}button{margin-top:16px;padding:10px 16px;background:#0366d6;color:#fff;border:none;border-radius:4px;}#status{margin-top:12px;font-weight:bold;}img{margin-top:16px;max-width:100%;height:auto;border:1px solid #ddd;border-radius:4px;}</style></head><body><h2>Parametres camera</h2>");
  html += "<label>Luminosite: <span id='brightnessValue'>" + String(imageSettings.brightness) + "</span></label>";
  html += "<input type='range' id='brightness' min='-2' max='2' value='" + String(imageSettings.brightness) + "' oninput=\"document.getElementById('brightnessValue').textContent=this.value\">";
  html += "<label>Contraste: <span id='contrastValue'>" + String(imageSettings.contrast) + "</span></label>";
  html += "<input type='range' id='contrast' min='-2' max='2' value='" + String(imageSettings.contrast) + "' oninput=\"document.getElementById('contrastValue').textContent=this.value\">";
  html += "<label>Saturation: <span id='saturationValue'>" + String(imageSettings.saturation) + "</span></label>";
  html += "<input type='range' id='saturation' min='-2' max='2' value='" + String(imageSettings.saturation) + "' oninput=\"document.getElementById('saturationValue').textContent=this.value\">";
  html += "<label>Resolution</label><select id='framesize'>" + buildFrameOptionsHtml() + "</select>";
  html += F("<button onclick=\"saveSettings()\">Appliquer</button><button style='background:#0b8457;margin-left:8px;' onclick=\"refreshPreview()\">Capture test</button><div id='status'></div><img id='preview' alt='Previsualisation' src=''/>\n<script>function saveSettings(){const body={brightness:parseInt(document.getElementById('brightness').value),contrast:parseInt(document.getElementById('contrast').value),saturation:parseInt(document.getElementById('saturation').value),framesize:document.getElementById('framesize').value};fetch('/api/settings',{method:'POST',headers:{'Content-Type':'application/json'},body:JSON.stringify(body)}).then(r=>r.json()).then(()=>{document.getElementById('status').textContent=\"Reglages appliques\";}).catch(()=>{document.getElementById('status').textContent=\"Erreur d'enregistrement\";});}\nfunction refreshPreview(){document.getElementById('preview').src='/capture?ts='+Date.now();}\n</script></body></html>");
  server.send(200, "text/html", html);
}

void handleCapture()
{
  logHttpRequest(server.uri());

  // Vider le buffer existant pour forcer une nouvelle capture
  camera_fb_t *old_fb = esp_camera_fb_get();
  if (old_fb)
  {
    esp_camera_fb_return(old_fb);
  }

  // Petite pause pour laisser le capteur se stabiliser
  delay(100);

  // Maintenant capturer une image fraîche
  camera_fb_t *fb = esp_camera_fb_get();
  if (!fb)
  {
    sendJsonError(500, "Capture echouee");
    return;
  }

  WiFiClient client = server.client();
  if (!client)
  {
    esp_camera_fb_return(fb);
    sendJsonError(500, "Client invalide");
    return;
  }

  client.print("HTTP/1.1 200 OK\r\n");
  client.print("Content-Type: image/jpeg\r\n");
  client.print("Content-Length: ");
  client.print(fb->len);
  client.print("\r\nCache-Control: no-store, no-cache, must-revalidate\r\n");
  client.print("Pragma: no-cache\r\n");
  client.print("Expires: 0");
  client.print("\r\nConnection: close\r\n\r\n");
  client.write(fb->buf, fb->len);
  client.stop();
  esp_camera_fb_return(fb);
}

void handleApiConfigAll()
{
  logHttpRequest(server.uri());
  server.send(200, "application/json", buildFullConfigJson());
}

void handleApiSettingsGet()
{
  logHttpRequest(server.uri());
  server.send(200, "application/json", buildSettingsJsonPayload(true));
}

void handleApiSettingsPost()
{
  logHttpRequest(server.uri());
  String body = consumeRequestBody();
  if (body.length() == 0)
  {
    sendJsonError(400, "Payload vide");
    return;
  }
  bool updated = false;
  int newValue;
  if (extractJsonInt(body, "brightness", newValue))
  {
    imageSettings.brightness = clampSetting(newValue);
    updated = true;
  }
  if (extractJsonInt(body, "contrast", newValue))
  {
    imageSettings.contrast = clampSetting(newValue);
    updated = true;
  }
  if (extractJsonInt(body, "saturation", newValue))
  {
    imageSettings.saturation = clampSetting(newValue);
    updated = true;
  }
  String frameValue;
  if (extractJsonString(body, "framesize", frameValue))
  {
    imageSettings.framesize = frameSizeFromString(frameValue);
    updated = true;
  }
  if (!updated)
  {
    sendJsonError(400, "Aucun parametre valide");
    return;
  }
  applyImageSettings();
  saveImageSettings();
  server.send(200, "application/json", buildSettingsJsonPayload(true));
}

