IM-Lab-france/ReefControl/esp32_cam_eye/esp32_cam_eye.ino
void handleApiWifiPost()
{
  logHttpRequest(server.uri());
  String body = consumeRequestBody();
  if (body.length() == 0)
  {
    sendJsonError(400, "Payload vide");
    return;
  }
  String ssid;
  String password;
  if (!extractJsonString(body, "ssid", ssid))
  {
    sendJsonError(400, "SSID manquant");
    return;
  }
  if (!extractJsonString(body, "password", password))
  {
    password = "";
  }
  saveWifiConfig(ssid, password);
  server.send(200, "application/json", "{\"status\":\"saved\"}");
  delay(500);
  ESP.restart();
}

void handleNotFound()
{
  logHttpRequest(server.uri());
  if (apMode)
  {
    // En mode AP, redirige tout vers la page principale
    Serial.println(">>> Redirection captive vers /");
    handleRoot();
  }
  else
  {
    sendJsonError(404, "Route inconnue");
  }
}

void setupServer()
{
  server.on("/", HTTP_GET, handleRoot);
  server.on("/wifi", HTTP_GET, handleWifiPage);
  server.on("/image", HTTP_GET, handleImagePage);
  server.on("/capture", HTTP_GET, handleCapture);
  server.on("/api/config/all", HTTP_GET, handleApiConfigAll);
  server.on("/api/settings", HTTP_GET, handleApiSettingsGet);
  server.on("/api/settings", HTTP_POST, handleApiSettingsPost, handleRawRequestBody);
  server.on("/api/wifi", HTTP_POST, handleApiWifiPost, handleRawRequestBody);
  server.onNotFound(handleNotFound);
  server.begin();
  Serial.println("HTTP server demarre");
}

void setup()
{
  Serial.begin(115200);
  Serial.setDebugOutput(true);
  prefs.begin("CONFIG", false);
  loadConfigs();
  initCamera();
  WiFi.onEvent(wifiEventHandler);
  startWiFi();
  if (staConnected)
  {
    setupOTA();
  }
  setupServer();

  Serial.println("========================================");
  Serial.printf("Mode: %s\n", apMode ? "AP" : "STA");
  Serial.printf("IP: %s\n", apMode ? WiFi.softAPIP().toString().c_str() : WiFi.localIP().toString().c_str());
  if (apMode)
  {
    Serial.printf("SSID: %s\n", apSSID.c_str());
    Serial.printf("Password: %s\n", AP_PASSWORD);
    Serial.println("Connecte-toi et va sur http://192.168.4.1");
  }
}
void loop()
{
  server.handleClient();
  if (apMode && dnsRunning)
  {
    dnsServer.processNextRequest();
  }
  if (otaEnabled)
  {
    ArduinoOTA.handle();
  }
}
